'**************************************************************************************
'* プログラム名 ： Excel実行スクリプト                                                *
'* 処理概要     ： Excelを実行するだけのスクリプト                                    *
'* メモ         ： Excelがインストールされていなければ実行されません                  *
'* 設定         ：                                                                    *
'**************************************************************************************

'*****************************************
'* 変数                                  *
'*****************************************
Dim mObjShell : Set mObjShell = WScript.CreateObject("WScript.Shell")

Main()

'***********************************************************************
'* 処理名   ： メイン処理                                              *
'* 引数     ： なし                                                    *
'* 処理内容 ： メイン処理                                              *
'* 戻り値   ： なし                                                    *
'***********************************************************************
Sub Main()

    'Excel実行処理
    mObjShell.Run "excel.exe"

    'オブジェクトの破棄処理
    Set mObjShell = Nothing

End Sub

